# Dispose Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarShapeDrivenAccessor..::..Dispose Method
RebarShapeDrivenAccessor Class See Also
---
Releases all resources used by the RebarShapeDrivenAccessor
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void Dispose()
```

Visual Basic
---
```text
Public Sub Dispose
```

Visual C++
---
```text
public:
virtual void Dispose() sealed
```

# ### Implements
IDisposable..::..Dispose()()()()
# See Also
RebarShapeDrivenAccessor Class
Autodesk.Revit.DB.Structure Namespace